Управление_торговлей.ПБТ/src/DataProcessors/ВнешняяОбработка1/ВнешняяОбработка1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВнешняяОбработка1</name>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>документ</name>
      <type>
        <types>DocumentRef.вт_ОтчетПроизводства</types>
        <types>AnyRef</types>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>документ1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Управление_торговлей.ПБТ/src/DataProcessors/ВнешняяОбработка1/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Соответствие = ЗагрузитьСоответствие();
	
	Объект.Список.Очистить();
	
	Запрос = Новый Запрос;
	
	Если ЗагрузитьВыпуск Тогда
	
		Запрос.Текст = "ВЫБРАТЬ
			|	вт_ОтчетПроизводства.Ссылка КАК Ссылка,
			|	вт_ОтчетПроизводстваТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
			|	вт_ОтчетПроизводстваТовары.Серия КАК Серия
			|ПОМЕСТИТЬ ВТ_Список
			|ИЗ
			|	Документ.вт_ОтчетПроизводства КАК вт_ОтчетПроизводства
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.вт_ОтчетПроизводства.Товары КАК вт_ОтчетПроизводстваТовары
			|		ПО (вт_ОтчетПроизводства.Ссылка = вт_ОтчетПроизводстваТовары.Ссылка)
			|ГДЕ
			|	вт_ОтчетПроизводства.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И вт_ОтчетПроизводства.Проведен
			|	И вт_ОтчетПроизводства.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
			|
			|СГРУППИРОВАТЬ ПО
			|	вт_ОтчетПроизводства.Ссылка,
			|	вт_ОтчетПроизводстваТовары.СтатусУказанияСерий,
			|	вт_ОтчетПроизводстваТовары.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Список.Ссылка КАК Ссылка,
			|	ВТ_Список.Серия КАК Серия
			|ИЗ
			|	ВТ_Список КАК ВТ_Список 
			|
			| УПОРЯДОЧИТЬ ПО
			| ВТ_Список.Ссылка.Дата ";

			//|ГДЕ
			//|	ВТ_Список.Серия = &Серия 
			//| И 
			//|	Не ВТ_Список.СтатусУказанияСерий = 0";
		
		
	ИначеЕсли ЗагрузитьРеализацию Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
			|	РеализацияТоваровУслугТовары.Серия КАК Серия
			|ПОМЕСТИТЬ ВТ_Список
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугТовары.Ссылка
			|ГДЕ
			|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И РеализацияТоваровУслуг.Проведен
			|	И РеализацияТоваровУслуг.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваровУслуг.Ссылка,
			|	РеализацияТоваровУслугТовары.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Список.Ссылка КАК Ссылка,
			|	ВТ_Список.Серия КАК Серия
			|ИЗ
			|	ВТ_Список КАК ВТ_Список ";
			//|ГДЕ
			//|	ВТ_Список.Серия = &Серия";
			
		
	
	ИначеЕсли ЗагрузитьПеремещения Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПеремещениеТоваров.Ссылка КАК Ссылка,
			|	ПеремещениеТоваровТовары.Серия КАК Серия
			|ПОМЕСТИТЬ ВТ_Список
			|ИЗ
			|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			|		ПО ПеремещениеТоваров.Ссылка = ПеремещениеТоваровТовары.Ссылка
			|ГДЕ
			|	ПеремещениеТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ПеремещениеТоваров.Проведен
			|
			|СГРУППИРОВАТЬ ПО
			|	ПеремещениеТоваров.Ссылка,
			|	ПеремещениеТоваровТовары.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Список.Ссылка КАК Ссылка,
			|	ВТ_Список.Серия КАК Серия
			|ИЗ
			|	ВТ_Список КАК ВТ_Список ";
			//|ГДЕ
			//|	ВТ_Список.Серия = &Серия";
		
		
	ИначеЕсли ЗагрузитьПоступления Тогда

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
			|	ПриобретениеТоваровУслугТовары.Серия КАК Серия
			|ПОМЕСТИТЬ ВТ_Список
			|ИЗ
			|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
			|		ПО ПриобретениеТоваровУслуг.Ссылка = ПриобретениеТоваровУслугТовары.Ссылка
			|ГДЕ
			|	ПриобретениеТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ПриобретениеТоваровУслуг.Проведен
			|	И ПриобретениеТоваровУслуг.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
			|
			|СГРУППИРОВАТЬ ПО
			|	ПриобретениеТоваровУслуг.Ссылка,
			|	ПриобретениеТоваровУслугТовары.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Список.Ссылка КАК Ссылка,
			|	ВТ_Список.Серия КАК Серия
			|ИЗ
			|	ВТ_Список КАК ВТ_Список ";
			//|ГДЕ
			//|	ВТ_Список.Серия = &Серия";

	
		
	ИначеЕсли ЗагрузитьСписаниеНаРасходы Тогда

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВнутреннееПотреблениеТоваров.Ссылка КАК Ссылка,
			|	ВнутреннееПотреблениеТоваровТовары.Серия КАК Серия
			|ПОМЕСТИТЬ ВТ_Список
			|ИЗ
			|	Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
			|		ПО ВнутреннееПотреблениеТоваров.Ссылка = ВнутреннееПотреблениеТоваровТовары.Ссылка
			|ГДЕ
			|	ВнутреннееПотреблениеТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ВнутреннееПотреблениеТоваров.Проведен
			|	И ВнутреннееПотреблениеТоваров.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
			|
			|СГРУППИРОВАТЬ ПО
			|	ВнутреннееПотреблениеТоваров.Ссылка,
			|	ВнутреннееПотреблениеТоваровТовары.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Список.Ссылка КАК Ссылка,
			|	ВТ_Список.Серия КАК Серия
			|ИЗ
			|	ВТ_Список КАК ВТ_Список
			|ГДЕ
			|	ВТ_Список.Серия = &Серия";
	
		
	ИначеЕсли ЗагрузитьОприходованиеИзлишковТоваров Тогда    

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОприходованиеИзлишковТоваров.Ссылка КАК Ссылка,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОприходованиеИзлишковТоваровТовары.Серия) КАК Серия
			|ПОМЕСТИТЬ ВТ_Список
			|ИЗ
			|	Документ.ОприходованиеИзлишковТоваров КАК ОприходованиеИзлишковТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
			|		ПО ОприходованиеИзлишковТоваров.Ссылка = ОприходованиеИзлишковТоваровТовары.Ссылка
			|ГДЕ
			|	ОприходованиеИзлишковТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ОприходованиеИзлишковТоваров.Проведен
			|	И ОприходованиеИзлишковТоваров.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
			|
			|СГРУППИРОВАТЬ ПО
			|	ОприходованиеИзлишковТоваров.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Список.Ссылка КАК Ссылка,
			|	ВТ_Список.Серия КАК Серия
			|ИЗ
			|	ВТ_Список КАК ВТ_Список
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВТ_Список.Ссылка.Дата";
		
		
		
			//|ГДЕ
			//|	ВТ_Список.Серия = &Серия";

		
		
		
		ИначеЕсли ЗагрузитьПередачаСырьяВПереработку Тогда    

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОприходованиеИзлишковТоваров.Ссылка КАК Ссылка,
			|	ОприходованиеИзлишковТоваровТовары.Серия КАК Серия
			|ПОМЕСТИТЬ ВТ_Список
			|ИЗ
			|	Документ.ОприходованиеИзлишковТоваров КАК ОприходованиеИзлишковТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
			|		ПО ОприходованиеИзлишковТоваров.Ссылка = ОприходованиеИзлишковТоваровТовары.Ссылка
			|ГДЕ
			|	ОприходованиеИзлишковТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ОприходованиеИзлишковТоваров.Проведен
			|	И ОприходованиеИзлишковТоваров.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
			|
			|СГРУППИРОВАТЬ ПО
			|	ОприходованиеИзлишковТоваров.Ссылка,
			|	ОприходованиеИзлишковТоваровТовары.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Список.Ссылка КАК Ссылка,
			|	ВТ_Список.Серия КАК Серия
			|ИЗ
			|	ВТ_Список КАК ВТ_Список
			|ГДЕ
			|	ВТ_Список.Серия = &Серия";
	
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Начало));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Окончание));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.Список.Добавить();
		НоваяСтрока.документ = ВыборкаДетальныеЗаписи.Ссылка;                                                      
		НоваяСтрока.документ1 = ВыборкаДетальныеЗаписи.Ссылка; 
		
		
		//Если ЗагрузитьВыпуск Тогда
		
			//ИсправитьНаСервере(ВыборкаДетальныеЗаписи.Ссылка, Соответствие)
		
		////КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьОрдерНаОприходование(ДокументСсылка)

	ДокОбектОрдер = Документы.ОрдерНаОтражениеИзлишковТоваров.СоздатьДокумент();
	
	ДокОбъект = ДокументСсылка.ПолучитьОбъект();
	
	ЗаполнитьЗначенияСвойств(ДокОбектОрдер, ДокОбъект);
	
	Для каждого Строка Из ДокОбъект.Товары Цикл
	
		НоваяСтрока = ДокОбектОрдер.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		НоваяСтрока.КоличествоУпаковок = Строка.Количество;
		
	КонецЦикла;
	
	ДокОбектОрдер.Комментарий = ДокОбъект.Комментарий + ": Создан на основании " + ДокОбъект.Ссылка;
	
	ДокОбектОрдер.Записать(РежимЗаписиДокумента.Проведение);
	
	
КонецПроцедуры

&НаСервере
Процедура ИсправитьНаСервере(ДокументСсылка, Соответствие)
		
	ДокОбъект = ДокументСсылка.ПолучитьОбъект();
	
	БылиИзменения = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		
		ИмяТаблицы = СтрРазделить("Товары", ",");
		ИмяКолонкиСерия = "Серия";
		ЕстьКолонкаСтатусУказанияСерий = Истина;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.вт_ОтчетПроизводства") Тогда 
		
		ДокОбъект.Серии.Очистить();		
		
		ИмяТаблицы = СтрРазделить("Товары,вт_ПроизводствоСырье", ",");   
		ИмяКолонкиСерия = "Серия";
		ЕстьКолонкаСтатусУказанияСерий = Истина;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда 
		
		ИмяТаблицы = СтрРазделить("Товары", ",");
		ИмяКолонкиСерия = "Серия";
		ЕстьКолонкаСтатусУказанияСерий = Истина;		
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		
		ИмяТаблицы = СтрРазделить("Товары", ",");
		ИмяКолонкиСерия = "Серия";
		ЕстьКолонкаСтатусУказанияСерий = Истина;		
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВнутреннееПотреблениеТоваров") Тогда 
		
		ИмяТаблицы = СтрРазделить("Товары", ",");
		ИмяКолонкиСерия = "Серия";
		ЕстьКолонкаСтатусУказанияСерий = Истина;		
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда 
		
		ИмяТаблицы = СтрРазделить("Товары", ",");
		ИмяКолонкиСерия = "Серия";
		ЕстьКолонкаСтатусУказанияСерий = Истина;		
		
		СоздатьОрдерНаОприходование(ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.вт_ПередачаСырьяВПереработку") Тогда 
		
		ИмяТаблицы = СтрРазделить("Товары", ",");
		ИмяКолонкиСерия = "Серия";
		ЕстьКолонкаСтатусУказанияСерий = Истина;		
	
	КонецЕсли;
	
	
	
	//Если ИсправитьСтатусУказанияСерий Тогда
	//
	//	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	//	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры = Истина;
	//	ПараметрыУказанияСерий.ПолноеИмяОбъекта = ДокументСсылка.Метаданные().ПолноеИмя();
	//	ПараметрыУказанияСерий.ИмяТЧТовары = "Товары";
	//	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокОбъект, ПараметрыУказанияСерий);
	//	
	//	ДокОбъект.Записать();

	//КонецЕсли;
	

	
	
	//////////////////////
	//Если ИсправитьСерииВДокументе Тогда
	
		Для каждого Имя Из ИмяТаблицы Цикл
		
			Для каждого ТабСтрока Из ДокОбъект[Имя] Цикл
				
				//Если Не ЗначениеЗаполнено(ТабСтрока[ИмяКолонкиСерия]) Тогда
					
				БылиИзменения = Истина;
				
				ВидНоменклатуры = ТабСтрока.Номенклатура.ВидНоменклатуры;
				
				Если Не ВидНоменклатуры.ИспользоватьСерии Тогда
					ТабСтрока.СтатусУказанияСерий = 0;
					Продолжить;
				КонецЕсли;
				
				ТабСтрока.СтатусУказанияСерий = 14;
				
				Если Не ЗначениеЗаполнено(ТабСтрока[ИмяКолонкиСерия]) Тогда
					ТабСтрока[ИмяКолонкиСерия] = Соответствие[ВидНоменклатуры];
				КонецЕсли;
				
				
				Если ТабСтрока[ИмяКолонкиСерия].Наименование = "Пустая серия" 
					И Не ТабСтрока[ИмяКолонкиСерия] = Соответствие[ВидНоменклатуры] Тогда
					ТабСтрока[ИмяКолонкиСерия] = Соответствие[ВидНоменклатуры];
				КонецЕсли;
				
				//Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда 
				//	ТабСтрока.СтатусУказанияСерийОтправитель = 14;
				//	ТабСтрока.СтатусУказанияСерийПолучатель = 14;
				//КонецЕсли;
				
				//КонецЕсли;
				
			КонецЦикла;
		
		КонецЦикла;
		
	//КонецЕсли;
	
	//Если БылиИзменения Тогда
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	//КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ИсправитьНаСервере1()

	Соответствие = ЗагрузитьСоответствие();
	
	Для каждого Строка Из Объект.Список Цикл

		ИсправитьНаСервере(Строка.документ, Соответствие);

	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Исправить(Команда)
	ИсправитьНаСервере1();
КонецПроцедуры












&НаСервере
Функция ЗагрузитьСоответствие()

	Соответствие = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка,
	|	СерииНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", "Пустая серия");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Соответствие.Вставить(ВыборкаДетальныеЗаписи.ВидНоменклатуры, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()

	НоваяСтрока = Объект.список.Добавить();
	НоваяСтрока.документ = Документы.вт_ОтчетПроизводства.ПустаяСсылка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
